pmo-dataset/variations/mermaid_with_ids/51.mmd
graph LR
	classDef endEvent stroke-width:3px
	Task_1["Employee submits a\nvacation request"]
	Task_2["Requirement is\nregistered"]
	Task_3["Employee's\nsupervisor receive\nthe request"]
	Task_4["Supervisor approve\nor reject the\nrequest"]
	Task_5["Application is\nreturned to employee"]
	Task_6["Notification is\ngenerated to the HR\nRepresentative"]
	Task_7["HR Representative\ncomplete the\nrespective\nmanagement\nprocedures"]
	Task_8["Employee can check\nrejection reasons"]
	StartNoneEvent_1((" "))
	EndNoneEvent_1((" ")):::endEvent
	ExclusiveGateway_1{"X"}
	ExclusiveGateway_2{"X"}

	StartNoneEvent_1 --> Task_1
	Task_1 --> Task_2
	Task_2 --> Task_3
	Task_3 --> Task_4
	Task_4 --> ExclusiveGateway_1
	Task_6 --> Task_7
	Task_7 --> ExclusiveGateway_2
	ExclusiveGateway_2 --> EndNoneEvent_1
	ExclusiveGateway_1 -->|"rejected"| Task_5
	ExclusiveGateway_1 -->|"approved"| Task_6
	Task_5 --> Task_8
	Task_8 --> ExclusiveGateway_2
